from common.get_keyboard_func import get_keyboard


admin_main = get_keyboard('Добавить медиа➕', 'Просмотреть🕶', 'Ничего🌊', 'Добавить/Изменить баннер➕')

admin_add = get_keyboard("Фильмы/Сериалы📺", "Смотреть тут🔽", "Вопросы для говорения❓", "Топики для чтения🧾",
                         "Книги для чтения📚", "Вопросы для письма❔", "Мемы💡", "Мотивация🔥", "Грамматика📗",
                         "Слэнг🛴", "Субтитры к фильмам💻", "Тесты⁉", "Назад🔙")

admin_back_cancel = get_keyboard("Назад🔙", "Отмена❌")

admin_cancel = get_keyboard("Отмена❌")
