from aiogram.utils.formatting import Bold, as_marked_section


categories = ["Слова", "Аудирование", "Говорение", "Чтение", "Письмо", "Спец. пак"]

sub_categories = ["Фильмы/Сериалы", "Смотреть тут", "Вопросы для говорения", "Топики для чтения",
                  "Книги для чтения", "Вопросы для письма", "Мемы", "Мотивация", "Грамматика",
                  "Субтитры к фильмам"]

description_for_info_pages = {
    "main": "Добро пожаловать!",
    "read!": "Обязательно для прочтения для всех",
    "spec_pack": as_marked_section(
        Bold("Спец. пакет включает в себя:\n"),
        "Мемы",
        "Мотивация",
        "Грамматика",
        "Сленг",
        "Тесты",
        marker="✅ ",
    ).as_html(),
    "catalog": "Категории:\n",
    "sub_catalog": "Подкатегории:\n",
}
